In [1]:
# Initial imports
import pandas as pd

In [2]:
# Load the NBA_Full_Draft_1947-2018.csv dataset.
file_path = "Resources/NBA_Full_Draft_1947-2018.csv"
full_draft_df = pd.read_csv(file_path)
full_draft_df.head()

,Unnamed: 0,Team,Player,College,Play_Yrs,Games,Year,Pick
0,1,PIT,Clifton McNeeley,University of Texas at El Paso,NaN,NaN,1947,1
1,2,TRH,Glen Selbo,University of Wisconsin,1.0,13.0,1947,2
2,3,BOS,Bulbs Ehlers,Purdue University,2.0,99.0,1947,3
3,4,PRO,Walt Dropo,University of Connecticut,NaN,NaN,1947,4
4,5,NYK,Dick Holub,Long Island University,1.0,48.0,1947,5

In [3]:
# Create a new DataFrame that holds only the Player Name, Year, and Pick Columns.
draft_df = full_draft_df[['Player', 'Year', 'Pick']].copy()
draft_df.head()

             Player  Year  Pick
0  Clifton McNeeley  1947     1
1        Glen Selbo  1947     2
2      Bulbs Ehlers  1947     3
3        Walt Dropo  1947     4
4        Dick Holub  1947     5

In [4]:
# Keep only records for players drafted from 1980 forward.
draft_df = draft_df[draft_df['Year'] >= 1980]
draft_df.head()

                 Player  Year  Pick
4545  Joe Barry Carroll  1980     1
4546   Darrell Griffith  1980     2
4547       Kevin McHale  1980     3
4548      Kelvin Ransey  1980     4
4549          James Ray  1980     5

In [5]:
# Identify incomplete rows
draft_df.count()

Player    3418
Year      3418
Pick      3418
dtype: int64

In [6]:
# Check datatypes
draft_df.dtypes

Player    object
Year       int64
Pick       int64
dtype: object

In [7]:
# Convert Player column to String
draft_df['Player'] = draft_df['Player'].astype(str)
draft_df.head()

                 Player  Year  Pick
4545  Joe Barry Carroll  1980     1
4546   Darrell Griffith  1980     2
4547       Kevin McHale  1980     3
4548      Kelvin Ransey  1980     4
4549          James Ray  1980     5

In [9]:
# Export to CSV
export_path = "Resources/draft_position.csv"
draft_df.to_csv(export_path)